# 第4章 Pandas数据分析包

In [4]:
import numpy as np
import pandas as pd

### 主要内容

* Pandas的基本数据结构：Series（Time-Series）和DataFrame（Panel）
+ Series的生成和基本操作
+ DataFrame的生成和基本操作(增删改查，聚合，基本统计计算等）
- 案例

### 2、DataFrame的生成和基本操作

#### 2.1、DataFrame生成的常见两种方式：

通过数组生成和通过字典生成

In [5]:
#生成一个6*3列的DataFrame df
#以日期为主索引，从20180725开始，往后6天
dates=pd.date_range('20180725',periods=6)
#生成6行3列的随机二维DataFrame
#使用日期作为行索引，列名为A，B，C
df1 = pd.DataFrame(np.random.randn(6,3),index=dates,columns=['A','B','C'])
print(df1)
print(df1.shape)
print(df1.values)
print(df1.index)
print(df1.columns)

                   A         B         C
2018-07-25  1.400955  0.025317  1.530736
2018-07-26  1.455474 -0.590277  1.392449
2018-07-27 -0.989444  1.050991  0.097803
2018-07-28 -0.816127 -0.293484  0.172314
2018-07-29 -0.854432  1.382547  0.120918
2018-07-30  0.740705 -1.213021  0.302397
(6, 3)
[[ 1.40095521  0.0253166   1.53073607]
 [ 1.45547424 -0.59027676  1.39244889]
 [-0.98944364  1.05099106  0.09780261]
 [-0.816127   -0.29348424  0.1723138 ]
 [-0.85443172  1.38254715  0.12091771]
 [ 0.74070513 -1.21302114  0.30239738]]
DatetimeIndex(['2018-07-25', '2018-07-26', '2018-07-27', '2018-07-28',
               '2018-07-29', '2018-07-30'],
              dtype='datetime64[ns]', freq='D')
Index(['A', 'B', 'C'], dtype='object')

DataFrame除了index名以外，还多了一个columns名

In [6]:
#通过字典data来构造二维数组s3
data = {'name':['Python','Java','C++'], 
                'score':[95,85,95], 
                'year':[2018, 2017, 2016]} 
print('字典data:')
print(data)
s3 = pd.DataFrame(data)
print('DataFrame s3:')
print(s3)
print('s3.shape=',s3.shape)
print('s3.index=',s3.index)
print('s3.values=',s3.values)

字典data:
{'name': ['Python', 'Java', 'C++'], 'score': [95, 85, 95], 'year': [2018, 2017, 2016]}
DataFrame s3:
     name  score  year
0  Python     95  2018
1    Java     85  2017
2     C++     95  2016
s3.shape= (3, 3)
s3.index= RangeIndex(start=0, stop=3, step=1)
s3.values= [['Python' 95 2018]
 ['Java' 85 2017]
 ['C++' 95 2016]]

In [7]:
#创建特定数据的DataFrame
print('构造新的DataFrame:')
df_1=pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20180310'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'
                    })
print('df_1:')
print(df_1)
print('各列数据类型:')
print(df_1.dtypes)

构造新的DataFrame:
df_1:
     A          B    C  D      E    F
0  1.0 2018-03-10  1.0  3   test  foo
1  1.0 2018-03-10  1.0  3  train  foo
2  1.0 2018-03-10  1.0  3   test  foo
3  1.0 2018-03-10  1.0  3  train  foo
各列数据类型:
A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

#### 2.2、DataFrame数据的访问：切片访问

In [8]:
# 生成一个6*3列的DataFrame df
# 以日期为主索引，从20180725开始，往后30天
dates = pd.date_range('20180725', periods=30)
# 生成6行3列的随机二维DataFrame
# 使用日期作为行索引，列名为A，B，C
df1 = pd.DataFrame(np.random.randn(30, 3), index=dates,
                   columns=['A', 'B', 'C'])
print('df1:')
print(df1)

df1:
                   A         B         C
2018-07-25 -0.771811 -0.608586 -0.769815
2018-07-26 -2.325152  0.374092  0.388037
2018-07-27 -0.896952  0.843832  0.470933
2018-07-28  1.507442 -0.702480 -0.215718
2018-07-29  0.661898 -0.510146  0.186526
2018-07-30  0.148548 -0.272339 -0.354321
2018-07-31 -1.242165 -0.239464  0.992399
2018-08-01 -0.962540 -0.864446  0.039083
2018-08-02 -0.407141 -2.155051 -0.422566
2018-08-03  1.791979  0.515821  2.121954
2018-08-04  0.770419 -0.641120 -0.023831
2018-08-05  0.306227 -0.520640  0.983310
2018-08-06 -0.461090 -2.290732 -0.987071
2018-08-07  1.372108  0.142054 -1.474311
2018-08-08 -0.274292 -0.606328 -0.398800
2018-08-09  1.766215 -0.294180  2.119684
2018-08-10  0.710355  1.252364  1.067018
2018-08-11 -0.112260  1.564811 -0.749187
2018-08-12  1.419388  1.975647  0.079599
2018-08-13  0.612926  0.657806 -0.829383
2018-08-14 -1.011711  0.507931  1.525198
2018-08-15  0.687195  1.243383 -1.751538
2018-08-16 -0.977160  2.421428 -0.949361
2018-08-17 -0.545597 -0.023073  0.997880
2018-08-18 -0.396819  0.127531 -2.548215
2018-08-19 -0.605128 -1.297398 -0.079915
2018-08-20 -0.373850 -0.263413  0.292781
2018-08-21 -0.952942 -0.241057 -1.183509
2018-08-22  0.495371 -0.353354 -2.321969
2018-08-23  0.897395  0.073664 -0.031068

访问列:DataFrame是带有标签的二维数组，每个标签相当于一列的列名，所以可以像字典访问某个key的值一样，使用对应的列名，就可以实现单列数据的访问。

In [18]:
df1['A'].head()

2018-07-25   -0.771811
2018-07-26   -2.325152
2018-07-27   -0.896952
2018-07-28    1.507442
2018-07-29    0.661898
Freq: D, Name: A, dtype: float64

In [17]:
df1.A.head() #类似于R语言dataframe的df1$a

2018-07-25   -0.771811
2018-07-26   -2.325152
2018-07-27   -0.896952
2018-07-28    1.507442
2018-07-29    0.661898
Freq: D, Name: A, dtype: float64

In [16]:
df1[['A','B']].head()

                   A         B
2018-07-25 -0.771811 -0.608586
2018-07-26 -2.325152  0.374092
2018-07-27 -0.896952  0.843832
2018-07-28  1.507442 -0.702480
2018-07-29  0.661898 -0.510146

访问某一列的几行：单一列是一个一维的Series，所以按照Series访问就行

In [12]:
print("df1的第A列第1个元素是：\n",df1['A']['2018-07-25'])
print("df1的第A列的前两个元素是：\n",df1['A'][0:3])

2018-07-25   -0.771811
2018-07-26   -2.325152
2018-07-27   -0.896952
2018-07-28    1.507442
2018-07-29    0.661898
2018-07-30    0.148548
2018-07-31   -1.242165
2018-08-01   -0.962540
2018-08-02   -0.407141
2018-08-03    1.791979
2018-08-04    0.770419
2018-08-05    0.306227
2018-08-06   -0.461090
2018-08-07    1.372108
2018-08-08   -0.274292
2018-08-09    1.766215
2018-08-10    0.710355
2018-08-11   -0.112260
2018-08-12    1.419388
2018-08-13    0.612926
2018-08-14   -1.011711
2018-08-15    0.687195
2018-08-16   -0.977160
2018-08-17   -0.545597
2018-08-18   -0.396819
2018-08-19   -0.605128
2018-08-20   -0.373850
2018-08-21   -0.952942
2018-08-22    0.495371
2018-08-23    0.897395
Freq: D, Name: A, dtype: float64
df1的第A列第1个元素是：
 -0.771811458994513
df1的第A列的前两个元素是：
 2018-07-25   -0.771811
2018-07-26   -2.325152
2018-07-27   -0.896952
Freq: D, Name: A, dtype: float64

访问行

In [13]:
#df1['2018-07-25']
#df1[0]

In [14]:
df1[0:2]

                   A         B         C
2018-07-25 -0.771811 -0.608586 -0.769815
2018-07-26 -2.325152  0.374092  0.388037

df[ ]后面接列名，默认对列进行访问，接数字范围，默认对行进行访问

In [21]:
df1[0:1]['A']

2018-07-25   -0.771811
Freq: D, Name: A, dtype: float64

dataframe也可以通过head和tail得到多行数据

In [ ]:
df1.head()

                   A         B         C
2018-07-25  0.944705  0.488802 -1.367680
2018-07-26 -0.093890  0.532532  1.064494
2018-07-27  1.425078  0.423769  1.179328
2018-07-28  0.135038 -0.100141  1.043514
2018-07-29  0.609194  1.750651 -0.496497

In [ ]:
df1.tail()

                   A         B         C
2018-08-19 -0.815153  0.071628  1.267925
2018-08-20  0.113795 -0.268164  0.966678
2018-08-21 -2.554541 -0.146669 -0.109613
2018-08-22  0.087815 -0.297130  0.385605
2018-08-23  0.247919  0.156313  0.593856

** 切片访问loc,iloc: df1.loc[需要的行名，需要的列名]， df1.iloc[行的范围，列的范围]**

In [ ]:
print("利用loc访问：\n",df1.loc[['2018-07-25','2018-07-27'],['A','B']])

利用loc访问：
                    A         B
2018-07-25 -0.824008  0.073868
2018-07-27  0.826779 -0.838580

In [ ]:
print("利用iloc访问：\n",df1.iloc[0:3,0:2])

利用iloc访问：
                    A         B
2018-07-25 -0.824008  0.073868
2018-07-26 -0.550505  0.013808
2018-07-27  0.826779 -0.838580

In [22]:
print("利用loc访问第一,二列：\n",df1.loc[:,['A','B']].head())

利用loc访问第一,二列：
                    A         B
2018-07-25 -0.771811 -0.608586
2018-07-26 -2.325152  0.374092
2018-07-27 -0.896952  0.843832
2018-07-28  1.507442 -0.702480
2018-07-29  0.661898 -0.510146

In [23]:
print("利用iloc访问第一,二列：\n",df1.iloc[:,[0,1]].head())

利用iloc访问第一,二列：
                    A         B
2018-07-25 -0.771811 -0.608586
2018-07-26 -2.325152  0.374092
2018-07-27 -0.896952  0.843832
2018-07-28  1.507442 -0.702480
2018-07-29  0.661898 -0.510146

In [ ]:
print("利用loc访问：\n",df1.loc[['2018-07-25','2018-08-20'],['A','C']])

利用loc访问第一,二列：
                    A         C
2018-07-25  0.944705 -1.367680
2018-08-20  0.113795  0.966678

In [ ]:
print("：\n",df1.iloc[[0,26],[0,2]])

：
                    A         C
2018-07-25  0.944705 -1.367680
2018-08-20  0.113795  0.966678

#### 3.3、DataFrame数据的操作：增删改查

增加列

In [ ]:
df1['D'] = np.random.randn(30)  # 直接增加一个标签
df1['E'] = 100

In [24]:
print('增加列后的df1：\n',df1.head())

增加列后的df1：
                    A         B         C
2018-07-25 -0.771811 -0.608586 -0.769815
2018-07-26 -2.325152  0.374092  0.388037
2018-07-27 -0.896952  0.843832  0.470933
2018-07-28  1.507442 -0.702480 -0.215718
2018-07-29  0.661898 -0.510146  0.186526

增加行：借助loc

In [ ]:
df1.loc['2018-08-24'] = np.random.randn(5)

In [ ]:
print('增加行后的df1：\n',df1)

增加行后的df1：
                             A         B         C         D          E
2018-07-25 00:00:00 -1.560964 -0.569692 -1.085795 -1.993068  100.00000
2018-07-26 00:00:00  0.617043 -0.699993 -0.098020  0.662120  100.00000
2018-07-27 00:00:00 -1.047988  2.394908 -0.330180 -0.510555  100.00000
2018-07-28 00:00:00 -0.045544  0.391090 -0.017925 -1.078149  100.00000
2018-07-29 00:00:00 -0.342511 -1.906578  0.555677 -0.039681  100.00000
2018-07-30 00:00:00  0.081707 -0.254454  0.992761  0.619298  100.00000
2018-07-31 00:00:00  0.368610 -0.355114 -0.923982 -0.641986  100.00000
2018-08-01 00:00:00 -0.420090 -0.277469  0.645901  0.002577  100.00000
2018-08-02 00:00:00  0.834372 -0.068587 -0.323400 -0.473160  100.00000
2018-08-03 00:00:00  0.595333 -1.309837  0.216276 -1.110158  100.00000
2018-08-04 00:00:00  0.822070  1.104194  0.496328  0.224245  100.00000
2018-08-05 00:00:00  0.604401 -0.769626 -1.495632  0.038127  100.00000
2018-08-06 00:00:00  0.061232  0.723341 -0.043580  1.053568  100.00000
2018-08-07 00:00:00 -0.298421 -0.349703  0.697284 -3.100199  100.00000
2018-08-08 00:00:00  0.633400  0.950522 -0.288768 -0.044777  100.00000
2018-08-09 00:00:00 -0.588400  0.497445  0.442685  2.183090  100.00000
2018-08-10 00:00:00 -0.736865 -0.942345 -1.594637  0.570756  100.00000
2018-08-11 00:00:00  0.174782 -1.367314 -0.773715 -0.262740  100.00000
2018-08-12 00:00:00  0.449917 -0.605777  1.927381  1.493459  100.00000
2018-08-13 00:00:00 -0.315847 -0.811842  0.249570  0.161830  100.00000
2018-08-14 00:00:00 -1.492560  1.860030  1.194173 -0.406526  100.00000
2018-08-15 00:00:00  0.445013 -0.426797 -0.340907 -0.136818  100.00000
2018-08-16 00:00:00 -1.432283  1.782190  1.407405  1.002649  100.00000
2018-08-17 00:00:00  0.941685  0.210603 -0.438995 -0.560822  100.00000
2018-08-18 00:00:00  0.782845  0.297674 -0.771675  1.808409  100.00000
2018-08-19 00:00:00 -1.446090  1.355587 -1.885760 -0.803679  100.00000
2018-08-20 00:00:00 -0.282220 -0.902361  1.286233  0.335775  100.00000
2018-08-21 00:00:00  0.712163 -1.063906  1.459725  1.275647  100.00000
2018-08-22 00:00:00  0.796458  0.401089 -0.954397  0.765876  100.00000
2018-08-23 00:00:00  1.257838  0.700552 -1.029645 -0.142784  100.00000
2018-08-24 00:00:00 -0.448412  0.296047  1.803004 -1.101795    0.04897

删：删除DataFrame中的某列或者某行的数据：drop（）

* 调用格式：df.drop(labels,axis=0,level=None,inplace=False,errors='raise')
+ labels：接收string或者array，代表需要删除的行（列）的标签。
+ axis：接收0或者1，代表操作轴的方向，默认为0.0表示删除行，1表示删除列
- inplace：接收boolean。代表操作是否对原数据生效，默认为False，操作对元数据不生效，不改变原数据。

改：修改DataFrame中的数据，基本方法就是将这部分数据提取出来，重新赋值为新的数据

In [ ]:
df1.loc['2018-08-24 00:00:00',:] = 1

In [27]:
df1.head()

                   A         B         C
2018-07-25 -0.771811 -0.608586 -0.769815
2018-07-26 -2.325152  0.374092  0.388037
2018-07-27 -0.896952  0.843832  0.470933
2018-07-28  1.507442 -0.702480 -0.215718
2018-07-29  0.661898 -0.510146  0.186526

In [ ]:
df1.loc[:,"E"] = 200

In [28]:
df1.head()

                   A         B         C
2018-07-25 -0.771811 -0.608586 -0.769815
2018-07-26 -2.325152  0.374092  0.388037
2018-07-27 -0.896952  0.843832  0.470933
2018-07-28  1.507442 -0.702480 -0.215718
2018-07-29  0.661898 -0.510146  0.186526

查：访问元素，将满足条件的元素提取出来

#### 3.4、描述性分析DataFrame数据

describe函数

In [ ]:
df1.describe() #所有数值型特征的基本统计分析

               A          B          C          D      E
count  31.000000  31.000000  31.000000  31.000000   31.0
mean    0.037713   0.031866   0.005625   0.061043  200.0
std     0.816270   1.033972   0.979906   1.079061    0.0
min    -1.560964  -1.906578  -1.885760  -3.100199  200.0
25%    -0.381300  -0.734810  -0.772695  -0.491858  200.0
50%     0.174782  -0.254454  -0.043580   0.002577  200.0
75%     0.672782   0.711946   0.671592   0.713998  200.0
max     1.257838   2.394908   1.927381   2.183090  200.0

In [ ]:
df1[['A','C']].describe() #指定列的基本统计分析

               A          C
count  31.000000  31.000000
mean    0.037713   0.005625
std     0.816270   0.979906
min    -1.560964  -1.885760
25%    -0.381300  -0.772695
50%     0.174782  -0.043580
75%     0.672782   0.671592
max     1.257838   1.927381

更多的函数见教材P73，表4-6 Pandas数学运算与统计描述函数

In [ ]:
df1.median()

A      0.174782
B     -0.254454
C     -0.043580
D      0.002577
E    200.000000
dtype: float64

In [ ]:
df1.std()

A    0.816270
B    1.033972
C    0.979906
D    1.079061
E    0.000000
dtype: float64

In [ ]:
df1.mean()

A      0.037713
B      0.031866
C      0.005625
D      0.061043
E    200.000000
dtype: float64

In [ ]:
df1.var()

A    0.666296
B    1.069098
C    0.960215
D    1.164372
E    0.000000
dtype: float64

value_counts()函数：对于类别型（category类型数据）实现频数统计

示例

In [ ]:
dat.describe()

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,itemis_add,counts,amounts,cost,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,emp_id
count,2779.000000,2779.000000,2779.000000,0.0,0.0,2779.0,2779.000000,2779.000000,0.0,0.0,0.0,0.0,2779.0,0.0,0.0,2779.000000
mean,4545.617128,737.658150,609981.577906,NaN,NaN,0.0,1.111191,45.337172,NaN,NaN,NaN,NaN,0.0,NaN,NaN,1252.321339
std,1710.910552,312.694193,153.691844,NaN,NaN,0.0,0.625428,36.808550,NaN,NaN,NaN,NaN,0.0,NaN,NaN,170.157476
min,753.000000,137.000000,606057.000000,NaN,NaN,0.0,1.000000,1.000000,NaN,NaN,NaN,NaN,0.0,NaN,NaN,982.000000
25%,3263.000000,471.000000,609951.500000,NaN,NaN,0.0,1.000000,25.000000,NaN,NaN,NaN,NaN,0.0,NaN,NaN,1124.000000
50%,4386.000000,669.000000,609980.000000,NaN,NaN,0.0,1.000000,35.000000,NaN,NaN,NaN,NaN,0.0,NaN,NaN,1187.000000
75%,5758.500000,1026.000000,610019.000000,NaN,NaN,0.0,1.000000,56.000000,NaN,NaN,NaN,NaN,0.0,NaN,NaN,1402.000000
max,8238.000000,1323.000000,610072.000000,NaN,NaN,0.0,10.000000,178.000000,NaN,NaN,NaN,NaN,0.0,NaN,NaN,1610.000000

In [ ]:
dat['dishes_name'].value_counts()

白饭/大碗               92
凉拌菠菜                77
谷稻小庄                72
麻辣小龙虾               65
白饭/小碗               60
                    ..
照烧鸡腿_x000D_\n        1
百里香奶油烤紅酒牛肉           1
红酒土豆烧鸭腿_x000D_\n     1
五香酱驴肉_x000D_\n       1
冰镇花螺                 1
Name: dishes_name, Length: 154, dtype: int64

#### 3.5、表格合并

In [ ]:
?pd.merge

In [ ]:
#构造待合并表格DF4
df4= pd.DataFrame({'id':[1001,1002,1003,1004,1005,1006], 
'date':pd.date_range('20130102', periods=6),
'city':['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
'age':[23,44,54,32,34,32],
'category':['100-A','100-B','110-A','110-C','210-A','130-F'],
'price':[1200,np.nan,2133,5433,np.nan,4432]},
columns =['id','date','city','category','age','price'])

print('待合并表格df4:')
print(df4)

待合并表格df4:
     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [ ]:
#构造待合并表格DF5
df5=pd.DataFrame({'id':[1001,1002,1003,1004,1005,1006,1007,1008], 
'gender':['male','female','male','female','male','female','male','female'],
'pay':['Y','N','Y','Y','N','Y','N','Y',],
'm-point':[10,12,20,40,40,40,30,20]})
print('待合并表格df5:')
print(df5)

待合并表格df5:
     id  gender pay  m-point
0  1001    male   Y       10
1  1002  female   N       12
2  1003    male   Y       20
3  1004  female   Y       40
4  1005    male   N       40
5  1006  female   Y       40
6  1007    male   N       30
7  1008  female   Y       20

In [ ]:
print('df4与df5的交集:')
print('inner内连接，表示取df4和df5都存在的数据做连接:')
print(pd.merge(df4,df5,how='inner'))

df4与df5的交集:
inner内连接，表示取df4和df5都存在的数据做连接:
     id       date         city category  age   price  gender pay  m-point
0  1001 2013-01-02     Beijing     100-A   23  1200.0    male   Y       10
1  1002 2013-01-03           SH    100-B   44     NaN  female   N       12
2  1003 2013-01-04   guangzhou     110-A   54  2133.0    male   Y       20
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0  female   Y       40
4  1005 2013-01-06     shanghai    210-A   34     NaN    male   N       40
5  1006 2013-01-07     BEIJING     130-F   32  4432.0  female   Y       40

In [ ]:
print("df4与df5的合并，按照左表的数据:")
print('left左连接，表示按df4存在的数据做连接:')
print(pd.merge(df4,df5,how='left'))

df4与df5的合并，按照左表的数据:
left左连接，表示按df4存在的数据做连接:
     id       date         city category  age   price  gender pay  m-point
0  1001 2013-01-02     Beijing     100-A   23  1200.0    male   Y       10
1  1002 2013-01-03           SH    100-B   44     NaN  female   N       12
2  1003 2013-01-04   guangzhou     110-A   54  2133.0    male   Y       20
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0  female   Y       40
4  1005 2013-01-06     shanghai    210-A   34     NaN    male   N       40
5  1006 2013-01-07     BEIJING     130-F   32  4432.0  female   Y       40

In [ ]:
pd.merge(df4,df5,how='right')

     id       date         city category   age   price  gender pay  m-point
0  1001 2013-01-02     Beijing     100-A  23.0  1200.0    male   Y       10
1  1002 2013-01-03           SH    100-B  44.0     NaN  female   N       12
2  1003 2013-01-04   guangzhou     110-A  54.0  2133.0    male   Y       20
3  1004 2013-01-05     Shenzhen    110-C  32.0  5433.0  female   Y       40
4  1005 2013-01-06     shanghai    210-A  34.0     NaN    male   N       40
5  1006 2013-01-07     BEIJING     130-F  32.0  4432.0  female   Y       40
6  1007        NaT          NaN      NaN   NaN     NaN    male   N       30
7  1008        NaT          NaN      NaN   NaN     NaN  female   Y       20

In [ ]:
print("df4与df5的并集:")
print('outer外连接，表示求并集，不存在的数据项自动用NaN填充:')
print(pd.merge(df4,df5,how='outer'))

df4与df5的并集:
outer外连接，表示求并集，不存在的数据项自动用NaN填充:
     id       date         city category   age   price  gender pay  m-point
0  1001 2013-01-02     Beijing     100-A  23.0  1200.0    male   Y       10
1  1002 2013-01-03           SH    100-B  44.0     NaN  female   N       12
2  1003 2013-01-04   guangzhou     110-A  54.0  2133.0    male   Y       20
3  1004 2013-01-05     Shenzhen    110-C  32.0  5433.0  female   Y       40
4  1005 2013-01-06     shanghai    210-A  34.0     NaN    male   N       40
5  1006 2013-01-07     BEIJING     130-F  32.0  4432.0  female   Y       40
6  1007        NaT          NaN      NaN   NaN     NaN    male   N       30
7  1008        NaT          NaN      NaN   NaN     NaN  female   Y       20

In [ ]:
print("df4与df5的并集:")
print('outer外连接，表示求并集，不存在的数据项自动用NaN填充:')
print(pd.merge(df4,df5,how='cross'))

df4与df5的并集:
outer外连接，表示求并集，不存在的数据项自动用NaN填充:
    id_x       date         city category  age   price  id_y  gender pay  \
0   1001 2013-01-02     Beijing     100-A   23  1200.0  1001    male   Y
1   1001 2013-01-02     Beijing     100-A   23  1200.0  1002  female   N
2   1001 2013-01-02     Beijing     100-A   23  1200.0  1003    male   Y
3   1001 2013-01-02     Beijing     100-A   23  1200.0  1004  female   Y
4   1001 2013-01-02     Beijing     100-A   23  1200.0  1005    male   N
5   1001 2013-01-02     Beijing     100-A   23  1200.0  1006  female   Y
6   1001 2013-01-02     Beijing     100-A   23  1200.0  1007    male   N
7   1001 2013-01-02     Beijing     100-A   23  1200.0  1008  female   Y
8   1002 2013-01-03           SH    100-B   44     NaN  1001    male   Y
9   1002 2013-01-03           SH    100-B   44     NaN  1002  female   N
10  1002 2013-01-03           SH    100-B   44     NaN  1003    male   Y
11  1002 2013-01-03           SH    100-B   44     NaN  1004  female   Y
12  1002 2013-01-03           SH    100-B   44     NaN  1005    male   N
13  1002 2013-01-03           SH    100-B   44     NaN  1006  female   Y
14  1002 2013-01-03           SH    100-B   44     NaN  1007    male   N
15  1002 2013-01-03           SH    100-B   44     NaN  1008  female   Y
16  1003 2013-01-04   guangzhou     110-A   54  2133.0  1001    male   Y
17  1003 2013-01-04   guangzhou     110-A   54  2133.0  1002  female   N
18  1003 2013-01-04   guangzhou     110-A   54  2133.0  1003    male   Y
19  1003 2013-01-04   guangzhou     110-A   54  2133.0  1004  female   Y
20  1003 2013-01-04   guangzhou     110-A   54  2133.0  1005    male   N
21  1003 2013-01-04   guangzhou     110-A   54  2133.0  1006  female   Y
22  1003 2013-01-04   guangzhou     110-A   54  2133.0  1007    male   N
23  1003 2013-01-04   guangzhou     110-A   54  2133.0  1008  female   Y
24  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1001    male   Y
25  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1002  female   N
26  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1003    male   Y
27  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1004  female   Y
28  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1005    male   N
29  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1006  female   Y
30  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1007    male   N
31  1004 2013-01-05     Shenzhen    110-C   32  5433.0  1008  female   Y
32  1005 2013-01-06     shanghai    210-A   34     NaN  1001    male   Y
33  1005 2013-01-06     shanghai    210-A   34     NaN  1002  female   N
34  1005 2013-01-06     shanghai    210-A   34     NaN  1003    male   Y
35  1005 2013-01-06     shanghai    210-A   34     NaN  1004  female   Y
36  1005 2013-01-06     shanghai    210-A   34     NaN  1005    male   N
37  1005 2013-01-06     shanghai    210-A   34     NaN  1006  female   Y
38  1005 2013-01-06     shanghai    210-A   34     NaN  1007    male   N
39  1005 2013-01-06     shanghai    210-A   34     NaN  1008  female   Y
40  1006 2013-01-07     BEIJING     130-F   32  4432.0  1001    male   Y
41  1006 2013-01-07     BEIJING     130-F   32  4432.0  1002  female   N
42  1006 2013-01-07     BEIJING     130-F   32  4432.0  1003    male   Y
43  1006 2013-01-07     BEIJING     130-F   32  4432.0  1004  female   Y
44  1006 2013-01-07     BEIJING     130-F   32  4432.0  1005    male   N
45  1006 2013-01-07     BEIJING     130-F   32  4432.0  1006  female   Y
46  1006 2013-01-07     BEIJING     130-F   32  4432.0  1007    male   N
47  1006 2013-01-07     BEIJING     130-F   32  4432.0  1008  female   Y

    m-point
0        10
1        12
2        20
3        40
4        40
5        40
6        30
7        20
8        10
9        12
10       20
11       40
12       40
13       40
14       30
15       20
16       10
17       12
18       20
19       40
20       40
21       40
22       30
23       20
24       10
25       12
26       20
27       40
28       40
29       40
30       30
31       20
32       10
33       12
34       20
35       40
36       40
37       40
38       30
39       20
40       10
41       12
42       20
43       40
44       40
45       40
46       30
47       20